# IFCHybrid Import Options Hybrid Property Sets Property

Source: https://www.revitapidocs.com/2026/488d0175-00f5-0428-9cef-086e17195b4e.htm

---

| IFCHybrid Import Options Hybrid Property Sets Property |
| --- |

True if we should use AnyCAD to process property sets, false otherwise.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool HybridPropertySets { get; }
```

```
Public ReadOnly Property HybridPropertySets As Boolean
	Get
```

```
public:
property bool HybridPropertySets {
	bool get ();
}
```

```
member HybridPropertySets : bool with get
```

#### Property Value

Boolean See Also

#### Reference

IFCHybridImportOptions Class Autodesk.Revit.DB.IFC Namespace